In [45]:
import pandas as pd

# Series

In [46]:
data = [1, 2, 3, 4, 5]

In [47]:
s = pd.Series(data)

In [48]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [49]:
index = ['Linha' + str(i) for i in range(5)]

In [50]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [51]:
s = pd.Series(data = data, index = index)

In [52]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [53]:
data = {'linha' + str(i) : i + 1 for i in range(5)}

In [54]:
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [55]:
s = pd.Series(data)
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [56]:
s1 = s +2

In [57]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [58]:
s2 = s +s1
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

# Data Frame

In [59]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [60]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [61]:
df1 = pd.DataFrame(data = data)

In [62]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [63]:
index = ['linha' +str(i) for i in range(3)]

In [64]:
index

['linha0', 'linha1', 'linha2']

In [65]:
df1 = pd.DataFrame(data = data, index = index)

In [66]:
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [67]:
columns = ['coluna' +str(i) for i in range(3)]
columns

['coluna0', 'coluna1', 'coluna2']

In [68]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [69]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [70]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [71]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [72]:
df2 = pd.DataFrame(data)

In [73]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [74]:
data = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [75]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [76]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [78]:
df4 = pd.concat([df1, df2, df3])
df4

        coluna0  coluna1  coluna2  Coluna0  Coluna1  Coluna2
linha0      1.0      2.0      3.0      NaN      NaN      NaN
linha1      4.0      5.0      6.0      NaN      NaN      NaN
linha2      7.0      8.0      9.0      NaN      NaN      NaN
Linha0      NaN      NaN      NaN      1.0      2.0      3.0
Linha1      NaN      NaN      NaN      4.0      5.0      6.0
Linha2      NaN      NaN      NaN      7.0      8.0      9.0
linha0      1.0      2.0      3.0      NaN      NaN      NaN
linha1      4.0      5.0      6.0      NaN      NaN      NaN
linha2      7.0      8.0      9.0      NaN      NaN      NaN